<!DOCTYPE HTML>
<!-- NewPage -->
<html lang="ja">
<head>
<!-- Generated by javadoc (13) on Mon Mar 23 15:24:52 GMT+09:00 2020 -->
<title>定数フィールド値</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta name="dc.created" content="2020-03-23">
<meta name="description" content="summary of constants">
<meta name="generator" content="javadoc/ConstantsSummaryWriterImpl">
<link rel="stylesheet" type="text/css" href="stylesheet.css" title="Style">
<link rel="stylesheet" type="text/css" href="script-dir/jquery-ui.css" title="Style">
<script type="text/javascript" src="script.js"></script>
<script type="text/javascript" src="script-dir/jszip/dist/jszip.min.js"></script>
<script type="text/javascript" src="script-dir/jszip-utils/dist/jszip-utils.min.js"></script>
<!--[if IE]>
<script type="text/javascript" src="script-dir/jszip-utils/dist/jszip-utils-ie.min.js"></script>
<![endif]-->
<script type="text/javascript" src="script-dir/jquery-3.4.1.js"></script>
<script type="text/javascript" src="script-dir/jquery-ui.js"></script>
</head>
<body class="constants-summary">
<script type="text/javascript">var pathtoroot = "./";
loadScripts(document, 'script');</script>
<noscript>
<div>ブラウザのJavaScriptが無効になっています。</div>
</noscript>
<header role="banner">
<nav role="navigation">
<div class="fixedNav">
<!-- ========= START OF TOP NAVBAR ======= -->
<div class="topNav"><a id="navbar.top">
<!--   -->
</a>
<div class="skipNav"><a href="#skip.navbar.top" title="ナビゲーション・リンクをスキップ">ナビゲーション・リンクをスキップ</a></div>
<a id="navbar.top.firstrow">
<!--   -->
</a>
<ul class="navList" title="ナビゲーション">
<li><a href="index.html">概要</a></li>
<li>パッケージ</li>
<li>クラス</li>
<li><a href="overview-tree.html">階層ツリー</a></li>
<li><a href="deprecated-list.html">非推奨</a></li>
<li><a href="index-all.html">索引</a></li>
<li><a href="help-doc.html">ヘルプ</a></li>
</ul>
</div>
<div class="subNav">
<div class="navListSearch"><label for="search">SEARCH:</label>
<input type="text" id="search" value="search" disabled="disabled">
<input type="reset" id="reset" value="reset" disabled="disabled">
</div>
</div>
<a id="skip.navbar.top">
<!--   -->
</a>
<!-- ========= END OF TOP NAVBAR ========= -->
</div>
<div class="navPadding">&nbsp;</div>
<script type="text/javascript"><!--
$('.navPadding').css('padding-top', $('.fixedNav').css("height"));
//-->
</script>
</nav>
</header>
<main role="main">
<div class="header">
<h1 title="定数フィールド値" class="title">定数フィールド値</h1>
<section class="packages">
<h2 title="コンテンツ">コンテンツ</h2>
<ul>
<li><a href="#blackJack">blackJack.*</a></li>
</ul>
</section>
</div>
<div class="constantValuesContainer"><a id="blackJack">
<!--   -->
</a>
<section class="constantsSummary">
<h2 title="blackJack">blackJack.*</h2>
<ul class="blockList">
<li class="blockList">
<div class="constantsSummary">
<table>
<caption><span>blackJack.<a href="blackJack/BlackJackTable.html" title="blackJack内のクラス">BlackJackTable</a></span><span class="tabEnd">&nbsp;</span></caption>
<thead>
<tr>
<th class="colFirst" scope="col">修飾子とタイプ</th>
<th class="colSecond" scope="col">定数フィールド</th>
<th class="colLast" scope="col">値</th>
</tr>
</thead>
<tbody>
<tr class="altColor">
<td class="colFirst"><a id="blackJack.BlackJackTable.numberOfTimesToAcceptWrongMessage">
<!--   -->
</a><code>public&nbsp;static&nbsp;final&nbsp;int</code></td>
<th class="colSecond" scope="row"><code><a href="blackJack/BlackJackTable.html#numberOfTimesToAcceptWrongMessage">numberOfTimesToAcceptWrongMessage</a></code></th>
<td class="colLast"><code>5</code></td>
</tr>
<tr class="rowColor">
<td class="colFirst"><a id="blackJack.BlackJackTable.rulesString">
<!--   -->
</a><code>public&nbsp;static&nbsp;final&nbsp;java.lang.String</code></td>
<th class="colSecond" scope="row"><code><a href="blackJack/BlackJackTable.html#rulesString">rulesString</a></code></th>
<td class="colLast"><code>"\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u306f\u30c7\u30a3\u30fc\u30e9\u30fc\u5bfe\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u306e\u30b2\u30fc\u30e0\u3067\u3059\u3002\n\u4ed6\u306e\u30d7\u30ec\u30a4\u30e4\u30fc\u3068\u306e\u3084\u308a\u53d6\u308a\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\u7d75\u672d\u309210\u3001\u30a8\u30fc\u30b9\u30921\u307e\u305f\u306f11\u3068\u6570\u3048\u3066\u3001\u914d\u3089\u308c\u305f\u30ab\u30fc\u30c9\u306e\u5408\u8a08\u304c21\u306b\u8fd1\u3044\u307b\u3046\u304c\u52dd\u5229\u3068\u306a\u308a\u307e\u3059\u3002\n\u305f\u3060\u3057\u3001\u5408\u8a08\u304c22\u4ee5\u4e0a\u306b\u306a\u3063\u3066\u3057\u307e\u3046\u3068\u30d0\u30fc\u30b9\u30c8\u3068\u306a\u308a\u3001\u5373\u5ea7\u306b\u6557\u5317\u3068\u306a\u308a\u307e\u3059\u3002\n\u307e\u305f\u3001A\u306810\u306e2\u679a\u306721\u306b\u306a\u308b\u3053\u3068\u3092\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u3068\u3044\u3044\u30013\u679a\u4ee5\u4e0a\u306721\u306b\u306a\u308b\u3088\u308a\u3082\u5f37\u3044\u3067\u3059\u3002\n\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u306f\u30c7\u30a3\u30fc\u30e9\u30fc\u306b\u52dd\u3064\u3068\u8ced\u91d1\u3068\u540c\u984d\u306e\u914d\u5f53\u3092\u53d7\u3051\u3001\u81ea\u5206\u306e\u8ced\u91d1\u304c\u8fd4\u9084\u3055\u308c\u307e\u3059\u3002\n\u5f15\u304d\u5206\u3051\u306e\u30d7\u30ec\u30a4\u30e4\u30fc\u306b\u306f\u914d\u5f53\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u81ea\u5206\u306e\u8ced\u91d1\u306f\u623b\u3063\u3066\u304d\u307e\u3059\u3002\n\u6557\u5317\u3057\u305f\u30d7\u30ec\u30a4\u30e4\u30fc\u306e\u8ced\u91d1\u306f\u6ca1\u53ce\u3055\u308c\u307e\u3059\u3002\n\u307e\u305f\u3001\u7279\u5225\u306b\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u3067\u52dd\u5229\u3057\u305f\u3068\u304d\u306e\u307f\u914d\u5f53\u984d\u304c1.5\u500d\uff08\u7aef\u6570\u5207\u6368\u3066\uff09\u306b\u306a\u308a\u307e\u3059\u3002\n\u8ab0\u304b\u306e\u30c1\u30c3\u30d7\u304c\u5834\u306e\u6700\u4f4e\u8ced\u91d1\u3092\u4e0b\u56de\u308b\u304b\u3001\u3084\u3081\u308b\u3053\u3068\u3092\u9078\u629e\u3059\u308b\u307e\u3067\u30b2\u30fc\u30e0\u3092\u7e70\u308a\u8fd4\u3057\u307e\u3059\u3002\n\u30b2\u30fc\u30e0\u7d42\u4e86\u6642\u306b\u306f\u6240\u6301\u30c1\u30c3\u30d7\u306e\u91cf\u3067\u512a\u52a3\u3092\u3064\u3051\u307e\u3059\u3002\n\u30b2\u30fc\u30e0\u306e\u6d41\u308c\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059\u3002\n1.\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u306f\u307e\u305a\u8ced\u91d1\uff08\u30d9\u30c3\u30c8\u91d1\u984d\uff09\u3092\u6c7a\u3081\u307e\u3059\u3002\n\u3053\u306e\u3068\u304d\u8ced\u91d1\u30920\u306b\u8a2d\u5b9a\u3059\u308b\u30681\u30b2\u30fc\u30e0\u30d1\u30b9\u3067\u304d\u307e\u3059\u3002\n2.\u30d7\u30ec\u30a4\u30e4\u30fc\u304c\u5168\u54e1\u30d9\u30c3\u30c8\u3057\u7d42\u3048\u308b\u3068\u30c7\u30a3\u30fc\u30e9\u30fc\u304c\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u3068\u81ea\u8eab\u306b\u30ab\u30fc\u30c9\u30922\u679a\u914d\u308a\u307e\u3059\u3002\n\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u306e\u30ab\u30fc\u30c9\u306f\u3059\u3079\u3066\u8868\u5411\u304d\u306b\u914d\u3089\u308c\u307e\u3059\u3002\u30c7\u30a3\u30fc\u30e9\u30fc\u306e\u30ab\u30fc\u30c9\u306f2\u679a\u306e\u3046\u30611\u679a\u3060\u3051\u88cf\u5411\u304d\u306b\u914d\u3089\u308c\u307e\u3059\u3002\n\uff08\u6b21\u306e3\u30014\u306e\u624b\u9806\u306f\u7279\u5b9a\u306e\u6761\u4ef6\u4e0b\u306e\u5834\u5408\u306e\u307f\u5b58\u5728\u3057\u3001\u901a\u5e38\u306f\u3042\u308a\u307e\u305b\u3093\u3002\uff09\n3.\u30c7\u30a3\u30fc\u30e9\u30fc\u306e\u8868\u5411\u304d\u306e\u30ab\u30fc\u30c9\u304c\u30a8\u30fc\u30b9\u3060\u3063\u305f\u5834\u5408\u3001\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u306f\u8ced\u91d1\u306e\u534a\u5206\u4ee5\u4e0b\u3092\u6255\u3063\u3066\u30a4\u30f3\u30b7\u30e5\u30e9\u30f3\u30b9\u3092\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u3053\u306e\u30a4\u30f3\u30b7\u30e5\u30e9\u30f3\u30b9\u306f\u30c7\u30a3\u30fc\u30e9\u30fc\u304c\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u3067\u3042\u308b\u3053\u3068\u306b\u8ced\u3051\u308b\u8ffd\u52a0\u306e\u30c1\u30c3\u30d7\u3067\u3059\u3002\n4.\u30c7\u30a3\u30fc\u30e9\u30fc\u306b\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u306e\u53ef\u80fd\u6027\u304c\u3042\u308b\u5834\u5408\u306f\u3001\n\uff08\u30c7\u30a3\u30fc\u30e9\u30fc\u306e\u30aa\u30fc\u30d7\u30f3\u30ab\u30fc\u30c9\u304c\u30a8\u30fc\u30b9\u306e\u3068\u304d\u306f\u5168\u30d7\u30ec\u30a4\u30e4\u30fc\u306e\u30a4\u30f3\u30b7\u30e5\u30e9\u30f3\u30b9\u3092\u78ba\u8a8d\u3057\u305f\u5f8c\uff09\u3001\n\u30c7\u30a3\u30fc\u30e9\u30fc\u306f\u81ea\u5206\u306e\u304c\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u304b\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\n\u3082\u3057\u30c7\u30a3\u30fc\u30e9\u30fc\u304c\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u3060\u3063\u305f\u5834\u5408\u3001\u5373\u5ea7\u306b\u52dd\u6557\u304c\u6c7a\u5b9a\u3057\u307e\u3059\u3002\n\u3053\u306e\u3068\u304d\u3001\u30ca\u30c1\u30e5\u30e9\u30eb\u30d6\u30e9\u30c3\u30af\u30b8\u30e3\u30c3\u30af\u306e\u30d7\u30ec\u30a4\u30e4\u30fc\u306f\u5f15\u304d\u5206\u3051\u306b\u3001\u305d\u3046\u3067\u306a\u3044\u30d7\u30ec\u30a4\u30e4\u30fc\u306f\u6557\u5317\u306b\u306a\u308a\u307e\u3059\u3002\n\u307e\u305f\u3001\u3053\u306e\u3068\u304d\u30a4\u30f3\u30b7\u30e5\u30e9\u30f3\u30b9\u3092\u8ced\u3051\u3066\u3044\u305f\u30d7\u30ec\u30a4\u30e4\u30fc\u306b\u306f\u30a4\u30f3\u30b7\u30e5\u30e9\u30f3\u30b9\u5206\u306e2\u500d\u306e\u914d\u5f53\u304c\u3042\u308a\u3001\u30a4\u30f3\u30b7\u30e5\u30e9\u30f3\u30b9\u306e\u8ced\u91d1\u3082\u623b\u3063\u3066\u304d\u307e\u3059\u3002\n5.\u30c7\u30a3\u30fc\u30e9\u30fc\u306e\u5de6\u96a3\u306e\u30d7\u30ec\u30a4\u30e4\u30fc\u304b\u3089\u9806\u306b\u6b21\u306e\u3046\u3061\u3069\u308c\u304b\u3092\u9078\u629e\u3057\u307e\u3059\u3002\n   \u30fb\u30d2\u30c3\u30c8\uff1a\u30c7\u30a3\u30fc\u30e9\u30fc\u306b\u66f4\u306b1\u679a\u306e\u30ab\u30fc\u30c9\u3092\u914d\u3063\u3066\u3082\u3089\u3044\u307e\u3059\u3002\u30d0\u30fc\u30b9\u30c8\u3059\u308b\u307e\u3067\u7e70\u308a\u8fd4\u3057\u9078\u3076\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n   \u30fb\u30b9\u30bf\u30f3\u30c9\uff1a\u624b\u3092\u73fe\u72b6\u3067\u78ba\u5b9a\u3057\u3001\u30c7\u30a3\u30fc\u30e9\u30fc\u3068\u52dd\u8ca0\u3057\u307e\u3059\u3002\n   \u30fb\u30b5\u30ec\u30f3\u30c0\u30fc\uff1a\u81ea\u5206\u306e\u30ab\u30fc\u30c9\u304c\u6700\u521d\u306e2\u679a\u306e\u3068\u304d\u306e\u307f\u53ef\u80fd\u3067\u3059\u3002\u8ced\u91d1\u306e\u534a\u5206\u3092\u8ae6\u3081\u3001\u52dd\u8ca0\u304b\u3089\u964d\u308a\u307e\u3059\u3002\n   \u30fb\u30c0\u30d6\u30eb\u30c0\u30a6\u30f3\uff1a\u81ea\u5206\u306e\u30ab\u30fc\u30c9\u304c\u6700\u521d\u306e2\u679a\u306e\u3068\u304d\u306e\u307f\u53ef\u80fd\u3067\u3059\u3002\u8ced\u91d1\u3092\u500d\u306b\u4e0a\u4e57\u305b\u3057\u3001\u6b21\u306b\u914d\u3089\u308c\u308b1\u679a\u3092\u542b\u3081\u305f3\u679a\u3067\u52dd\u8ca0\u3092\u3057\u307e\u3059\u3002\n   \u30fb\u30b9\u30d7\u30ea\u30c3\u30c8\uff1a\u6700\u521d\u306e\u81ea\u5206\u306e\u30ab\u30fc\u30c92\u679a\u304c\u540c\u3058\u6570\u5b57\u3060\u3063\u305f\u3068\u304d\u306e\u307f\u53ef\u80fd\u3067\u3059\u3002\u81ea\u5206\u306e\u8ced\u91d1\u306e\u540c\u984d\u3092\u8ffd\u52a0\u3057\u3001\u81ea\u5206\u306e\u624b\u672d\u30922\u3064\u306b\u5206\u3051\u3066\u305d\u308c\u305e\u308c\u72ec\u7acb\u306b\u52dd\u8ca0\u3092\u884c\u3044\u307e\u3059\u3002\n6.\u3059\u3079\u3066\u306e\u30d7\u30ec\u30a4\u30e4\u30fc\u304c\u30b9\u30bf\u30f3\u30c9\u3082\u3057\u304f\u306f\u30b5\u30ec\u30f3\u30c0\u30fc\u3092\u3057\u305f\u3089\u3001\u30c7\u30a3\u30fc\u30e9\u30fc\u306f\u88cf\u5411\u304d\u306b\u3057\u3066\u3044\u305f\u30ab\u30fc\u30c9\u3092\u8868\u306b\u3057\u307e\u3059\u3002\n\u305d\u3057\u3066\u3001\u30c7\u30a3\u30fc\u30e9\u30fc\u306f\u81ea\u5206\u306e\u624b\u304c17\u4ee5\u4e0a\u306b\u306a\u308b\u307e\u3067\u30ab\u30fc\u30c9\u3092\u5f15\u304d\u307e\u3059\u3002\n\u30c7\u30a3\u30fc\u30e9\u30fc\u306e\u624b\u304c17\u4ee5\u4e0a\u306b\u306a\u3063\u305f\u3089\u305d\u306e\u6642\u306e\u30c7\u30a3\u30fc\u30e9\u30fc\u306e\u624b\u3068\u5404\u30d7\u30ec\u30a4\u30e4\u30fc\u3067\u52dd\u8ca0\u3092\u884c\u3044\u307e\u3059\u3002\n7.\u8ced\u91d1\u306e\u7cbe\u7b97\u3092\u884c\u3044\u3001\u6b21\u306e\u30b2\u30fc\u30e0\u3092\u59cb\u3081\u307e\u3059\u3002"</code></td>
</tr>
<tr class="altColor">
<td class="colFirst"><a id="blackJack.BlackJackTable.waitingTime">
<!--   -->
</a><code>public&nbsp;static&nbsp;final&nbsp;int</code></td>
<th class="colSecond" scope="row"><code><a href="blackJack/BlackJackTable.html#waitingTime">waitingTime</a></code></th>
<td class="colLast"><code>1000</code></td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</section>
</div>
</main>
<footer role="contentinfo">
<nav role="navigation">
<!-- ======= START OF BOTTOM NAVBAR ====== -->
<div class="bottomNav"><a id="navbar.bottom">
<!--   -->
</a>
<div class="skipNav"><a href="#skip.navbar.bottom" title="ナビゲーション・リンクをスキップ">ナビゲーション・リンクをスキップ</a></div>
<a id="navbar.bottom.firstrow">
<!--   -->
</a>
<ul class="navList" title="ナビゲーション">
<li><a href="index.html">概要</a></li>
<li>パッケージ</li>
<li>クラス</li>
<li><a href="overview-tree.html">階層ツリー</a></li>
<li><a href="deprecated-list.html">非推奨</a></li>
<li><a href="index-all.html">索引</a></li>
<li><a href="help-doc.html">ヘルプ</a></li>
</ul>
</div>
<a id="skip.navbar.bottom">
<!--   -->
</a>
<!-- ======== END OF BOTTOM NAVBAR ======= -->
</nav>
</footer>
</body>
</html>
